app/controllers/movies_controller.rb

  def index
    if params[:sort] == 'movie_title'
      @movies = Movie.find(:all, :order => 'title ASC')
    elsif params[:sort] == 'release_date'
      @movies = Movie.find(:all, :order => 'release_date ASC')
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','R')) ORDER BY release_date ASC
SELECT "movies".* FROM "movies" ORDER BY release_date ASC